In [40]:
import numpy as np
import pandas as pd

In [41]:
data = np.random.randn(4,3)

In [42]:
data

array([[-2.24672621,  0.16488946, -0.87032679],
       [ 0.98220683, -0.37623407,  1.22324333],
       [ 0.49629069, -0.52076509, -0.43233648],
       [ 0.0725817 ,  1.54422374,  1.50165698]])

In [43]:
# series tek boyutlu kabul eder
# dataframe serilerin birleşmesinden oluşan yapıdır
data_frame = pd.DataFrame(data)

In [44]:
data_frame

          0         1         2
0 -2.246726  0.164889 -0.870327
1  0.982207 -0.376234  1.223243
2  0.496291 -0.520765 -0.432336
3  0.072582  1.544224  1.501657

In [45]:
type(data_frame)

pandas.core.frame.DataFrame

In [46]:
type(data_frame[0])

pandas.core.series.Series

In [47]:
new_df = pd.DataFrame(data, index=["sanem","ali","nuran","mehmet"], columns=["salary","age","senior"])

In [48]:
new_df

          salary       age    senior
sanem  -2.246726  0.164889 -0.870327
ali     0.982207 -0.376234  1.223243
nuran   0.496291 -0.520765 -0.432336
mehmet  0.072582  1.544224  1.501657

In [49]:
new_df["age"]

sanem     0.164889
ali      -0.376234
nuran    -0.520765
mehmet    1.544224
Name: age, dtype: float64

In [50]:
new_df[["age","salary"]]

             age    salary
sanem   0.164889 -2.246726
ali    -0.376234  0.982207
nuran  -0.520765  0.496291
mehmet  1.544224  0.072582

In [51]:
new_df.loc["sanem"] # index ismine göre filtreler

salary   -2.246726
age       0.164889
senior   -0.870327
Name: sanem, dtype: float64

In [52]:
new_df.iloc[0] # index in eğer ismi yoksa

salary   -2.246726
age       0.164889
senior   -0.870327
Name: sanem, dtype: float64

In [53]:
new_df.iloc[:,1] # bütün rowları seçti ve 1. column getirir

sanem     0.164889
ali      -0.376234
nuran    -0.520765
mehmet    1.544224
Name: age, dtype: float64

In [54]:
new_df["extra"] = 10

In [55]:
new_df

          salary       age    senior  extra
sanem  -2.246726  0.164889 -0.870327     10
ali     0.982207 -0.376234  1.223243     10
nuran   0.496291 -0.520765 -0.432336     10
mehmet  0.072582  1.544224  1.501657     10

In [57]:
new_df.drop("extra",axis=1) # axis 1 yani column sil

          salary       age    senior
sanem  -2.246726  0.164889 -0.870327
ali     0.982207 -0.376234  1.223243
nuran   0.496291 -0.520765 -0.432336
mehmet  0.072582  1.544224  1.501657

In [58]:
new_df

          salary       age    senior  extra
sanem  -2.246726  0.164889 -0.870327     10
ali     0.982207 -0.376234  1.223243     10
nuran   0.496291 -0.520765 -0.432336     10
mehmet  0.072582  1.544224  1.501657     10

In [59]:
new_df.drop("extra",axis=1 , inplace=True) # inplace true ile yeni bir new_df e atanır ve ddeğişiklik kaydedilir

In [60]:
new_df["sanem"] = 10

In [61]:
new_df

          salary       age    senior  sanem
sanem  -2.246726  0.164889 -0.870327     10
ali     0.982207 -0.376234  1.223243     10
nuran   0.496291 -0.520765 -0.432336     10
mehmet  0.072582  1.544224  1.501657     10

In [ ]:
new_df.drop("sanem") # axis=0 default değer olarak belirlenir o yüzden row siler

          salary       age    senior  sanem
ali     0.982207 -0.376234  1.223243     10
nuran   0.496291 -0.520765 -0.432336     10
mehmet  0.072582  1.544224  1.501657     10

In [64]:
new_df

          salary       age    senior  sanem
sanem  -2.246726  0.164889 -0.870327     10
ali     0.982207 -0.376234  1.223243     10
nuran   0.496291 -0.520765 -0.432336     10
mehmet  0.072582  1.544224  1.501657     10

In [66]:
new_df.drop("sanem", axis=1, inplace=True)

In [67]:
new_df

          salary       age    senior
sanem  -2.246726  0.164889 -0.870327
ali     0.982207 -0.376234  1.223243
nuran   0.496291 -0.520765 -0.432336
mehmet  0.072582  1.544224  1.501657

In [68]:
new_df.loc["sanem"]

salary   -2.246726
age       0.164889
senior   -0.870327
Name: sanem, dtype: float64

In [82]:
new_df.iloc[0]

salary    -2.246726
age       20.000000
senior    -0.870327
Name: sanem, dtype: float64

In [69]:
new_df.loc["sanem"]["age"]

0.16488946314212052

In [70]:
new_df.loc["sanem","age"]

0.16488946314212052

In [72]:
new_df.loc["sanem","age"] = 20

In [73]:
new_df

          salary        age    senior
sanem  -2.246726  20.000000 -0.870327
ali     0.982207  -0.376234  1.223243
nuran   0.496291  -0.520765 -0.432336
mehmet  0.072582   1.544224  1.501657

In [74]:
new_df > 0

        salary    age  senior
sanem    False   True   False
ali       True  False    True
nuran     True  False   False
mehmet    True   True    True

In [75]:
new_df[new_df > 0]

          salary        age    senior
sanem        NaN  20.000000       NaN
ali     0.982207        NaN  1.223243
nuran   0.496291        NaN       NaN
mehmet  0.072582   1.544224  1.501657

In [ ]:
new_df[new_df["salary"] > 0.5] # maas kolonu 0.5 den büyük

       salary       age    senior
ali  0.982207 -0.376234  1.223243

In [ ]:
new_df.reset_index() # indexi ayrı bir kolon olarak açar

    index    salary        age    senior
0   sanem -2.246726  20.000000 -0.870327
1     ali  0.982207  -0.376234  1.223243
2   nuran  0.496291  -0.520765 -0.432336
3  mehmet  0.072582   1.544224  1.501657

In [79]:
reset_frame = new_df.reset_index()

In [80]:
reset_frame.loc[0]

index        sanem
salary   -2.246726
age           20.0
senior   -0.870327
Name: 0, dtype: object

In [83]:
new_indices = ["a","b","c","d"]

In [84]:
new_df["NewIndex"] = new_indices

In [85]:
new_df

          salary        age    senior NewIndex
sanem  -2.246726  20.000000 -0.870327        a
ali     0.982207  -0.376234  1.223243        b
nuran   0.496291  -0.520765 -0.432336        c
mehmet  0.072582   1.544224  1.501657        d

In [86]:
new_df.set_index("NewIndex",inplace=True)

In [88]:
new_df.loc["a"]

salary    -2.246726
age       20.000000
senior    -0.870327
Name: a, dtype: float64

In [ ]:
# multi index

In [89]:
first_index = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [90]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [91]:
zip_index = list(zip(first_index,inner_index))

In [92]:
zip_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [93]:
zip_index = pd.MultiIndex.from_tuples(zip_index)

In [94]:
zip_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [95]:
sample_values = np.ones((6,2))

In [96]:
big_df = pd.DataFrame(sample_values, index=zip_index, columns=["age","salary"])

In [97]:
big_df

                    age  salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [98]:
big_df["age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: age, dtype: float64

In [99]:
big_df.loc["Simpson"].loc["Homer"]

age       1.0
salary    1.0
Name: Homer, dtype: float64